public/programming/cv.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="programming.html">Programming</a> &gt;
</p>

<div id="outline-container-org2967064" class="outline-2">
<h2 id="org2967064">Giovanni Santini - CV</h2>
<div class="outline-text-2" id="text-org2967064">
</div>

<div id="outline-container-org708512b" class="outline-3">
<h3 id="org708512b">Education</h3>
<div class="outline-text-3" id="text-org708512b">
<p>
<b><b>Bachelor Degree in Computer Science</b></b> at the University of Trento in
norther Italy. My courses were the following:
</p>

<ul class="org-ul">
<li>Computer Architecture, Operating Systems, Parallel Computing,
Algorithms and Data Structures, Databases, Networking, Software
Engineering, Calculus 1, Introduction to Computer and Network
Security, Formal Languages and Compilers, Probability, Programming 1
and 2, Advanced Programming, Physics 1, Functioncal Programming,
Linear algebra, Mathematical Foundations for Computer Science,
Introduction to Web Programming, Logic, Introduction to Machine
Learning.</li>
</ul>

<p>
<b><b>Cyberchallenge</b></b>
</p>

<ul class="org-ul">
<li>I participated in the cybersecurity course Cyberchallenge in 2021,
held at the Università Politecnica delle Marche, achieving <b><b>first
place</b></b> in the internal competition and qualifying for the national
Attack and Defense competition. The course introduced me to the
fundamental concepts of cybersecurity with a hands-on approach
through the CTF (Capture The Flag) format.</li>
</ul>
</div>
</div>

<div id="outline-container-orga41a507" class="outline-3">
<h3 id="orga41a507">Projects</h3>
<div class="outline-text-3" id="text-orga41a507">
<p>
<a href="https://github.com/San7o/hive-operator/">Hive-ebpf kubernetes operator</a>:
</p>

<ul class="org-ul">
<li>I am developing an eBPF-based inode access logging tool for
kubernetes clusters. The project is supervides by Bruno Crispo from
the University of Trento.</li>
<li><b><b>Languages and Frameworks</b></b>: C, Go, Kubernetes, eBPF</li>
</ul>

<p>
<a href="https://github.com/San7o/Baldo-Scanner">Baldo Scanner</a>:
</p>

<ul class="org-ul">
<li>I developed an antivirus damenon written in C++ and a linux kernel
module. It incorporates static malware analysis capabilities through
signatures and rules, a simple kernel level firewall, a sandboxed
execution environment, and a kernel module to collect information
about calls to system calls.</li>
<li><b><b>Languages and Framewroks</b></b>: C, C++, kprobes, netlink, character devices, sqlite, cmake</li>
</ul>

<p>
<a href="https://github.com/San7o/valFuzz">valFuzz</a>:
</p>
<ul class="org-ul">
<li>A modern and cross-platform library for multi-threaded testing,
fuzzing and benchmarking for C++17 code. The library lets the user
quickly benchmark functions and produce reports in different
formats, It’s been used in different projects such as <a href="https://github.com/San7o/tenno-tl">tenno-tl</a> and
for my <a href="https://github.com/San7o/parallel-computing-cpp">parallel computing</a> coursework.</li>
<li><b><b>Languages and Framewroks</b></b>: C++, cmake</li>
</ul>
</div>
</div>

<div id="outline-container-org81d69e9" class="outline-3">
<h3 id="org81d69e9">Certifications</h3>
<div class="outline-text-3" id="text-org81d69e9">
<p>
NVIDIA, Fundamentals of Accelerated Computing with OpenACC, Hackathon
1º place:
</p>

<ul class="org-ul">
<li>I partecipated in a two days workshop introducing the basics of
accelerated computing using OpenACC, a powerful directive-based
programming model. I learned how to optimize and parallelize code to
fully leverage the capabilities of modern GPUs and CPUs.</li>
<li>The event ended with an hackathon about optimizing a machine
learning model, I achieved first place.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf6d900f" class="outline-3">
<h3 id="orgf6d900f">Contacts</h3>
<div class="outline-text-3" id="text-orgf6d900f">
<ul class="org-ul">
<li>email: <a href="mailto:giovanni.santini@proton.me">giovanni.santini@proton.me</a></li>
<li>github: <a href="https://github.com/San7o/">San7o</a></li>
<li>blog: <a href="https://giovanni-diary.netlify.app">Giovanni's Diary</a></li>
<li>mastodon: <a href="https://mastodon.social/@santo7">@santo7@mastodon.social</a></li>
<li>youtube: <a href="https://www.youtube.com/@giovannis-diary">@giovannis-diary</a></li>
</ul>

<hr />

<p>
Travel: <a href="programming.html">Programming</a>, <a href="../theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</div>
</body>
</html>
